In [30]:
import sqlite3
with sqlite3.connect('library.db') as con:
    cursor=con.cursor()
    query="Create table Books(title text, author text, year int, genre text)"
    cursor.execute(query)

OperationalError: table Books already exists

In [31]:
with sqlite3.connect('library.db') as con:
    cursor=con.cursor()
    query="""Insert into Books Values('To Kill a Mockingbird', 'Harper Lee', 1960, 'Fiction'),
    ('1984', 'George Orwell', 1949, 'Dystopian'),
    ('The Great Gatsby', 'F. Scott Fitzgerald', 1925, 'Classic');
    """
    cursor.executescript(query)

OperationalError: table Books has 5 columns but 4 values were supplied

In [32]:
with sqlite3.connect('library.db') as con:
    cursor=con.cursor()
    query="""Update Books set year=1950 where title='1984'""" 
    cursor.executescript(query)

In [33]:
with sqlite3.connect('library.db') as con:
    cursor=con.cursor()
    query=""" Select title, author from Books where genre="Dystopian"
    """
    data=cursor.executescript(query)
data.fetchall()

[]

In [34]:
with sqlite3.connect('library.db') as con:
    cursor=con.cursor()
    query='Delete from Books where year<1950'
    cursor.execute(query)

In [35]:
with sqlite3.connect('library.db') as con:
    cursor=con.cursor()
    query='Alter table Books add rating float'
    cursor.execute(query)

OperationalError: duplicate column name: rating

In [ ]:
with sqlite3.connect('library.db') as con:
    cursor=con.cursor()
    query="""Update Books set rating=4.8 where title='To Kill a Mockingbird';
    Update Books set rating=4.7 where title='1984';
    Update Books set rating=4.5 where title='The Great Gatsby';
    """

    cursor.executescript(query)

In [37]:
with sqlite3.connect('library.db') as con:
    cursor=con.cursor()
    query="Select * from Books Order by year ASC"
    data=cursor.execute(query)
data.fetchall()

[('1984', 'George Orwell', 1950, 'Dystopian', 4.7),
 ('To Kill a Mockingbird', 'Harper Lee', 1960, 'Fiction', 4.8)]